{"data":{"tag":{"title":"IEO","belongsTo":{"pageInfo":{"totalPages":1,"currentPage":1},"edges":[{"node":{"date":"2018-07-16T07:48:55","id":"152","title":"Initial Exchange Offering (IEO) — Pros and Cons","path":"/initial-exchange-offering-ieo-pros-and-cons","content":"\n<p>What is an Initial Exchange Offering (IEO)? As you would guess — its similar to the traditional Initial Coin Offering (ICO), but leaving the token sale be handled by an exchange. Naturally, if you are issuing a token in the near future you would start digging, reading, gathering opinions, comparing pros and cons and what not, so you decide what type of offering you should go for and what is most suitable for your project’s fundraising.</p>\n\n\n\n<p>In this posting I would like to share my opinion about the IEO’s — what are the pros and cons of this type of offering?</p>\n\n\n\n<p>As you may already know — we at <a href=\"https://hack.bg\" data-href=\"https://hack.bg\" target=\"_blank\"><strong>hack</strong></a><strong> </strong>strongly believe in blockchain technology and decentralization in all forms (our team is running fully decentralized), so the pros and cons comparison you are about to read is very influenced by this ideal and is mostly valid for IEO on a centralized exchange. Some of the points made are also valid for Decentralized Exchanges (DEX) and we recommend them all to take the points into consideration before incorporating IEO as part of their features and services.</p>\n\n\n\n<div class=\"wp-block-image wp-caption\"><figure class=\"aligncenter\"><img src=\"https://hack.bg/wp-content/uploads/2018/12/8c998-1cfIYEPtDUrSDq9ho3XuBWQ.png\" alt=\"\"/><figcaption>Initial Exchange Offering (IEO) — Pros vs&nbsp;Cons</figcaption></figure></div>\n\n\n\n<h3>Starting with the&nbsp;CONS:</h3>\n\n\n\n<ul><li>The IEO would be limited to an certain exchange, making it annoying for some investors to participate if they do not own an account in the same exchange. This requires additional KYC procedure and account verification approval time&nbsp;… which leads to the second con</li><li>Also almost any exchange requires KYC, so this is very inconvenient for lots of investors.</li><li>In security matter this approach for funding a project adds an additional point of failure (the exchange).</li><li>Running an Initial Exchange Offering you stumble upon a fundamental problem— a high number of coins are in the possession of very few people, which leads to risk of price manipulations.</li><li>It’s quite easy for big investors to manipulate the price of the token.</li><li>On a traditional centralized exchange, one do not own his private keys, and with exchanges making asset transfers internally (most of them, if not all, are doing this) with no transaction on the blockchain — which leaves the investor with tokens that he does not truly own.</li><li>Scammy projects would definitely want to do an IEO so your token could be listed on an exchange (so its easy for you to dump the coin after the crowdsale).</li></ul>\n\n\n\n<h3>The very few PROS of running an&nbsp;IEO:</h3>\n\n\n\n<ul><li>Its easier for the project to be listed on an exchange.</li><li>IEO adds, in the manner of speaking a sort of protection layer for the investor, as the token is already listed on an exchange. So in case the founders decide to disappear, there is still a chance for the investor to sell off his tokens *(if there is any demand).</li></ul>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>In resolution I think the traditional ICO and IEO fundrasing models are somewhat “broken” along the way and not fitting for a serious decentralized project. In my opinion, the only transperant and investor friendly way do a fundraising, today, is trough DAICO (idea suggested by <a href=\"https://ethresear.ch/t/explanation-of-daicos/465\" data-href=\"https://ethresear.ch/t/explanation-of-daicos/465\" target=\"_blank\">Vitalik Buterin</a> few months ago) which is an ICO incorporated with some of DAO’s aspects.</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>Hope this article helps you consider and realize some points you haven’t thought of.</p>\n","excerpt":"<p>What is an Initial Exchange Offering (IEO)? As you would guess — its similar to the traditional Initial Coin Offering (ICO), but leaving the token sale be handled by an exchange. Naturally, if you are issuing a token in the near future you would start digging, reading, gathering opinions, comparing pros and cons and what not, so [&hellip;]</p>\n","categories":[{"id":"7","title":"News","path":"/category/news"},{"id":"53","title":"Tech Talks","path":"/category/blockchain-tech-talks"}],"author":{"name":"Milen Radkov","path":"/author/milen"}}}]}}},"context":{}}